; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image0 - mode
	image1 - mode
	image3 - mode
	image2 - mode
	GroundStation0 - direction
	Star7 - direction
	GroundStation8 - direction
	Star2 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star4 - direction
	Star6 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image2)
	(supports instrument1 image1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 image3)
	(supports instrument2 image1)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(have_image Star9 image0)
	(have_image Planet10 image3)
	(have_image Star11 image2)
	(have_image Planet12 image0)
	(have_image Phenomenon13 image1)
	(have_image Planet14 image0)
	(have_image Star15 image1)
	(have_image Planet16 image2)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 9
2. (calibrate satellite0 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 0 of 9
3. (turn_to satellite0 star15 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star15)
   goals met: 0 of 9
4. (take_image satellite0 star15 instrument2 image1)
   added: (have_image star15 image1)
   goals met: 1 of 9
5. (turn_to satellite0 planet10 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 planet10)
   goals met: 1 of 9
6. (take_image satellite0 planet10 instrument2 image3)
   added: (have_image planet10 image3)
   goals met: 2 of 9
7. (turn_to satellite0 phenomenon13 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 9
8. (take_image satellite0 phenomenon13 instrument2 image1)
   added: (have_image phenomenon13 image1)
   goals met: 3 of 9
9. (turn_to satellite0 groundstation3 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 groundstation3)
   goals met: 3 of 9
10. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 3 of 9
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 9
12. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 3 of 9
13. (turn_to satellite0 planet12 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet12)
   goals met: 3 of 9
14. (take_image satellite0 planet12 instrument1 image0)
   added: (have_image planet12 image0)
   goals met: 4 of 9
15. (turn_to satellite0 planet14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet14)
   goals met: 4 of 9
16. (take_image satellite0 planet14 instrument1 image0)
   added: (have_image planet14 image0)
   goals met: 5 of 9
17. (turn_to satellite0 planet16 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet16)
   goals met: 5 of 9
18. (take_image satellite0 planet16 instrument1 image2)
   added: (have_image planet16 image2)
   goals met: 6 of 9
19. (turn_to satellite0 star11 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star11)
   goals met: 6 of 9
20. (take_image satellite0 star11 instrument1 image2)
   added: (have_image star11 image2)
   goals met: 7 of 9
21. (turn_to satellite0 star9 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star9)
   goals met: 7 of 9
22. (take_image satellite0 star9 instrument1 image0)
   added: (have_image star9 image0)
   goals met: 8 of 9
23. (turn_to satellite0 groundstation0 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation0)
   goals met: 9 of 9
